app/controllers/spaces_controller.rb

SELECT "spaces".* FROM "spaces"
---
  def index
    @spaces = Space.all

INSERT INTO "spaces" ("name", "price", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "alains brain"], ["price", 10000000], ["description", "is huge"], ["created_at", "2016-03-20 17:58:03.577560"], ["updated_at", "2016-03-20 17:58:03.577560"]]
---
  def create
    @space = Space.create(space_params)

SELECT  "spaces".* FROM "spaces" WHERE "spaces"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_space
      @space = Space.find(params[:id])